import numpy as np
import random

val = int (input ('Выберите способ заполнения списка: 1 - ручной ввод, 2 - генерация списка:  '))
if val == 1:  # Проверка условия, если пользователь ввел еденицу то производится ниже прописанный функционал
    while True:  # Считывание списка и сохранение в переменной\\Создание цикла, цикл будет продолжаться пока пользователь вводит данные не корректно
        try:  # Создаю конструкцию для обработки исключений
            array = np.array (input ().split ()).astype (int)  # В переменную записываю список введенный с клавиатуры
            break  # При правильном вводе цикл останавливается
        except ValueError:  # Если функция получает аргумент правильного типа, но несоответствующее значение, то выводится надпись с просьбой ввести заново последовательность цифр.
            print ("Пожалуйста, вводите только числа")
elif val == 2:  # Проверка условия, если пользователь ввел двоечку то производится ниже прописанный функционал
    array = np.random.randint (1, 100, 20)  # Производится генерация при помощи numpy с параметрами рандома целых чисел

print("Исходный список: ", array)  # Вывод исходного списка

i = 0
list_length = len (array) - 1 # Переменная хранящая в себе длину списка, которая в дальнейшем цикле будет меняться в зависимости от динамики размера списка

while i != list_length:
    chain_size = 0